tap "2389-research/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "xtool-org/tap"
tap "yakitrak/yakitrak"
brew "giflib"
brew "libpng"
brew "atuin"
brew "autoconf"
brew "awscli"
brew "bison"
brew "glib"
brew "cairo"
brew "cmake"
brew "cocoapods"
brew "colima"
brew "container"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "fish"
brew "flex"
brew "flyctl"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnupg"
brew "librsvg"
brew "graphviz"
brew "hugo"
brew "jpeg"
brew "jq"
brew "libgit2"
brew "llm"
brew "make"
brew "mas"
brew "micro"
brew "mise"
brew "mosh"
brew "ncdu"
brew "nextdns"
brew "nmap"
brew "ollama"
brew "pkgconf"
brew "poppler"
brew "repomix"
brew "ripgrep"
brew "tailscale"
brew "tmux"
brew "wget"
brew "xcodegen"
brew "xcodes"
brew "yadm"
brew "2389-research/tap/ccvault"
brew "2389-research/tap/mammoth"
brew "steipete/tap/gogcli"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
brew "supabase/tap/supabase"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password"
cask "1password-cli"
cask "airtable"
cask "android-commandlinetools"
cask "beeper"
cask "caffeine"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "disk-inventory-x"
cask "dropbox"
cask "font-consolas-for-powerline"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "granola"
cask "krisp"
cask "logi-options+"
cask "marked-app"
cask "mqttx"
cask "netnewswire"
cask "obsidian"
cask "openscad"
cask "orcaslicer"
cask "plex"
cask "plexamp"
cask "slack"
cask "spotify"
cask "tiles"
cask "whatsapp"
cask "xtool-org/tap/xtool"
cask "zed"
cask "zen"
cask "zoom"
mas "ColorSlurp", id: 1287239339
mas "Drafts", id: 1435957248
mas "Keynote", id: 409183694
mas "NextDNS", id: 1464122853
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
uv "pre-commit"
