tap "2389-research/tap"
tap "openclaw/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "xtool-org/tap"
tap "yakitrak/yakitrak"
brew "node"
brew "agent-browser"
brew "atuin"
brew "autoconf"
brew "awscli"
brew "bison"
brew "libpng"
brew "glib"
brew "cairo"
brew "cmake"
brew "cocoapods"
brew "colima"
brew "container"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "libogg"
brew "flac"
brew "flex"
brew "flyctl"
brew "fzf"
brew "giflib"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hugo"
brew "ipatool"
brew "jpeg"
brew "jq"
brew "leptonica"
brew "libb2"
brew "libgit2"
brew "libvorbis"
brew "mpg123"
brew "libsndfile"
brew "libudfread"
brew "llm"
brew "make"
brew "mas"
brew "micro"
brew "mise"
brew "mosh"
brew "ncdu"
brew "nextdns"
brew "nmap"
brew "node-red"
brew "node@22"
brew "nvm"
brew "ollama"
brew "openjdk"
brew "openjdk@17"
brew "pandoc"
brew "pkgconf"
brew "poppler"
brew "repomix"
brew "ripgrep"
brew "rust"
brew "summarize"
brew "tailscale"
brew "tmux"
brew "unbound"
brew "uv"
brew "wget"
brew "whisper-cpp"
brew "xcodegen"
brew "xcodes"
brew "yadm"
brew "yarn"
brew "yq"
brew "zbar"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "2389-research/tap/ccvault"
brew "2389-research/tap/jeff"
brew "2389-research/tap/mammoth"
brew "2389-research/tap/pulse"
brew "openclaw/tap/gogcli"
brew "openclaw/tap/wacli"
brew "supabase/tap/supabase"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password"
cask "1password-cli"
cask "airtable"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "anydesk"
cask "arc"
cask "beeper"
cask "caffeine"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "disk-inventory-x"
cask "docker-desktop"
cask "dropbox"
cask "flux-app"
cask "font-consolas-for-powerline"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "granola"
cask "home-assistant"
cask "krisp"
cask "lm-studio"
cask "logi-options+"
cask "lunasea"
cask "marked-app"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "miniconda"
cask "mqttx"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "openscad"
cask "orcaslicer"
cask "plex"
cask "plexamp"
cask "pop-app"
cask "postman"
cask "scroll-reverser"
cask "slack"
cask "sonos-s1-controller"
cask "spotify"
cask "tiles"
cask "visual-studio-code"
cask "whatsapp"
cask "xtool-org/tap/xtool"
cask "zed"
cask "zen"
cask "zoom"
mas "ColorSlurp", id: 1287239339
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
go "github.com/mvanhorn/cli-printing-press/v4/cmd/cli-printing-press"
cargo "cargo-llvm-cov"
cargo "cargo-ndk"
cargo "cargo-watch"
cargo "jeff"
cargo "jeff-tui"
cargo "uniffi-bindgen-cli"
cargo "wasm-pack"
uv "browser-use"
uv "pre-commit"
npm "@electron/asar"
npm "js-beautify"
npm "openclaw"
