tap "danielgatis/imgcat"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Configurable static site generator
brew "hugo"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Display images and gifs in your terminal
brew "danielgatis/imgcat/imgcat"
# Universal chat app powered by Matrix
cask "beeper"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# Screen colour temperature controller
cask "flux"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Noise cancelling application
cask "krisp"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source Dropbox client
cask "maestral"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Tool to manage the size and position of windows
cask "shiftit"
# Team communication and collaboration software
cask "slack"
# Controller for Gen 1 Sonos products
cask "sonos-s1-controller"
# Music streaming service
cask "spotify"
# Window manager
cask "tiles"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "ms-python.vscode-pylance"
